GopalSaraf/Practicals/PSDL/include/proc/pic16f15275.inc
// Register: RX1PPS
#define RX1PPS RX1PPS
RX1PPS                                   equ 01ECBh
// bitfield definitions
RX1PPS_PIN_POSN                          equ 0000h
RX1PPS_PIN_POSITION                      equ 0000h
RX1PPS_PIN_SIZE                          equ 0003h
RX1PPS_PIN_LENGTH                        equ 0003h
RX1PPS_PIN_MASK                          equ 0007h
RX1PPS_PORT_POSN                         equ 0003h
RX1PPS_PORT_POSITION                     equ 0003h
RX1PPS_PORT_SIZE                         equ 0002h
RX1PPS_PORT_LENGTH                       equ 0002h
RX1PPS_PORT_MASK                         equ 0018h
RX1PPS_RX1DTPPS_POSN                     equ 0000h
RX1PPS_RX1DTPPS_POSITION                 equ 0000h
RX1PPS_RX1DTPPS_SIZE                     equ 0005h
RX1PPS_RX1DTPPS_LENGTH                   equ 0005h
RX1PPS_RX1DTPPS_MASK                     equ 001Fh
RX1PPS_RX1DTPPS0_POSN                    equ 0000h
RX1PPS_RX1DTPPS0_POSITION                equ 0000h
RX1PPS_RX1DTPPS0_SIZE                    equ 0001h
RX1PPS_RX1DTPPS0_LENGTH                  equ 0001h
RX1PPS_RX1DTPPS0_MASK                    equ 0001h
RX1PPS_RX1DTPPS1_POSN                    equ 0001h
RX1PPS_RX1DTPPS1_POSITION                equ 0001h
RX1PPS_RX1DTPPS1_SIZE                    equ 0001h
RX1PPS_RX1DTPPS1_LENGTH                  equ 0001h
RX1PPS_RX1DTPPS1_MASK                    equ 0002h
RX1PPS_RX1DTPPS2_POSN                    equ 0002h
RX1PPS_RX1DTPPS2_POSITION                equ 0002h
RX1PPS_RX1DTPPS2_SIZE                    equ 0001h
RX1PPS_RX1DTPPS2_LENGTH                  equ 0001h
RX1PPS_RX1DTPPS2_MASK                    equ 0004h
RX1PPS_RX1DTPPS3_POSN                    equ 0003h
RX1PPS_RX1DTPPS3_POSITION                equ 0003h
RX1PPS_RX1DTPPS3_SIZE                    equ 0001h
RX1PPS_RX1DTPPS3_LENGTH                  equ 0001h
RX1PPS_RX1DTPPS3_MASK                    equ 0008h
RX1PPS_RX1DTPPS4_POSN                    equ 0004h
RX1PPS_RX1DTPPS4_POSITION                equ 0004h
RX1PPS_RX1DTPPS4_SIZE                    equ 0001h
RX1PPS_RX1DTPPS4_LENGTH                  equ 0001h
RX1PPS_RX1DTPPS4_MASK                    equ 0010h

// Register: CK1PPS
#define CK1PPS CK1PPS
CK1PPS                                   equ 01ECCh
// bitfield definitions
CK1PPS_PIN_POSN                          equ 0000h
CK1PPS_PIN_POSITION                      equ 0000h
CK1PPS_PIN_SIZE                          equ 0003h
CK1PPS_PIN_LENGTH                        equ 0003h
CK1PPS_PIN_MASK                          equ 0007h
CK1PPS_PORT_POSN                         equ 0003h
CK1PPS_PORT_POSITION                     equ 0003h
CK1PPS_PORT_SIZE                         equ 0002h
CK1PPS_PORT_LENGTH                       equ 0002h
CK1PPS_PORT_MASK                         equ 0018h
CK1PPS_TX1CKPPS_POSN                     equ 0000h
CK1PPS_TX1CKPPS_POSITION                 equ 0000h
CK1PPS_TX1CKPPS_SIZE                     equ 0005h
CK1PPS_TX1CKPPS_LENGTH                   equ 0005h
CK1PPS_TX1CKPPS_MASK                     equ 001Fh
CK1PPS_TX1CKPPS0_POSN                    equ 0000h
CK1PPS_TX1CKPPS0_POSITION                equ 0000h
CK1PPS_TX1CKPPS0_SIZE                    equ 0001h
CK1PPS_TX1CKPPS0_LENGTH                  equ 0001h
CK1PPS_TX1CKPPS0_MASK                    equ 0001h
CK1PPS_TX1CKPPS1_POSN                    equ 0001h
CK1PPS_TX1CKPPS1_POSITION                equ 0001h
CK1PPS_TX1CKPPS1_SIZE                    equ 0001h
CK1PPS_TX1CKPPS1_LENGTH                  equ 0001h
CK1PPS_TX1CKPPS1_MASK                    equ 0002h
CK1PPS_TX1CKPPS2_POSN                    equ 0002h
CK1PPS_TX1CKPPS2_POSITION                equ 0002h
CK1PPS_TX1CKPPS2_SIZE                    equ 0001h
CK1PPS_TX1CKPPS2_LENGTH                  equ 0001h
CK1PPS_TX1CKPPS2_MASK                    equ 0004h
CK1PPS_TX1CKPPS3_POSN                    equ 0003h
CK1PPS_TX1CKPPS3_POSITION                equ 0003h
CK1PPS_TX1CKPPS3_SIZE                    equ 0001h
CK1PPS_TX1CKPPS3_LENGTH                  equ 0001h
CK1PPS_TX1CKPPS3_MASK                    equ 0008h
CK1PPS_TX1CKPPS4_POSN                    equ 0004h
CK1PPS_TX1CKPPS4_POSITION                equ 0004h
CK1PPS_TX1CKPPS4_SIZE                    equ 0001h
CK1PPS_TX1CKPPS4_LENGTH                  equ 0001h
CK1PPS_TX1CKPPS4_MASK                    equ 0010h

// Register: RA0PPS
#define RA0PPS RA0PPS
RA0PPS                                   equ 01F10h
// bitfield definitions
RA0PPS_RA0PPS_POSN                       equ 0000h
RA0PPS_RA0PPS_POSITION                   equ 0000h
RA0PPS_RA0PPS_SIZE                       equ 0006h
RA0PPS_RA0PPS_LENGTH                     equ 0006h
RA0PPS_RA0PPS_MASK                       equ 003Fh
RA0PPS_RA0PPS0_POSN                      equ 0000h
RA0PPS_RA0PPS0_POSITION                  equ 0000h
RA0PPS_RA0PPS0_SIZE                      equ 0001h
RA0PPS_RA0PPS0_LENGTH                    equ 0001h
RA0PPS_RA0PPS0_MASK                      equ 0001h
RA0PPS_RA0PPS1_POSN                      equ 0001h
RA0PPS_RA0PPS1_POSITION                  equ 0001h
RA0PPS_RA0PPS1_SIZE                      equ 0001h
RA0PPS_RA0PPS1_LENGTH                    equ 0001h
RA0PPS_RA0PPS1_MASK                      equ 0002h
RA0PPS_RA0PPS2_POSN                      equ 0002h
RA0PPS_RA0PPS2_POSITION                  equ 0002h
RA0PPS_RA0PPS2_SIZE                      equ 0001h
RA0PPS_RA0PPS2_LENGTH                    equ 0001h
RA0PPS_RA0PPS2_MASK                      equ 0004h
RA0PPS_RA0PPS3_POSN                      equ 0003h
RA0PPS_RA0PPS3_POSITION                  equ 0003h
RA0PPS_RA0PPS3_SIZE                      equ 0001h
RA0PPS_RA0PPS3_LENGTH                    equ 0001h
RA0PPS_RA0PPS3_MASK                      equ 0008h
RA0PPS_RA0PPS4_POSN                      equ 0004h
RA0PPS_RA0PPS4_POSITION                  equ 0004h
RA0PPS_RA0PPS4_SIZE                      equ 0001h
RA0PPS_RA0PPS4_LENGTH                    equ 0001h
RA0PPS_RA0PPS4_MASK                      equ 0010h
RA0PPS_RA0PPS5_POSN                      equ 0005h
RA0PPS_RA0PPS5_POSITION                  equ 0005h
RA0PPS_RA0PPS5_SIZE                      equ 0001h
RA0PPS_RA0PPS5_LENGTH                    equ 0001h
RA0PPS_RA0PPS5_MASK                      equ 0020h

// Register: RA1PPS
#define RA1PPS RA1PPS
RA1PPS                                   equ 01F11h
// bitfield definitions
RA1PPS_RA1PPS_POSN                       equ 0000h
RA1PPS_RA1PPS_POSITION                   equ 0000h
RA1PPS_RA1PPS_SIZE                       equ 0006h
RA1PPS_RA1PPS_LENGTH                     equ 0006h
RA1PPS_RA1PPS_MASK                       equ 003Fh
RA1PPS_RA1PPS0_POSN                      equ 0000h
RA1PPS_RA1PPS0_POSITION                  equ 0000h
RA1PPS_RA1PPS0_SIZE                      equ 0001h
RA1PPS_RA1PPS0_LENGTH                    equ 0001h
RA1PPS_RA1PPS0_MASK                      equ 0001h
RA1PPS_RA1PPS1_POSN                      equ 0001h
RA1PPS_RA1PPS1_POSITION                  equ 0001h
RA1PPS_RA1PPS1_SIZE                      equ 0001h
RA1PPS_RA1PPS1_LENGTH                    equ 0001h
RA1PPS_RA1PPS1_MASK                      equ 0002h
RA1PPS_RA1PPS2_POSN                      equ 0002h
RA1PPS_RA1PPS2_POSITION                  equ 0002h
RA1PPS_RA1PPS2_SIZE                      equ 0001h
RA1PPS_RA1PPS2_LENGTH                    equ 0001h
RA1PPS_RA1PPS2_MASK                      equ 0004h
RA1PPS_RA1PPS3_POSN                      equ 0003h
RA1PPS_RA1PPS3_POSITION                  equ 0003h
RA1PPS_RA1PPS3_SIZE                      equ 0001h
RA1PPS_RA1PPS3_LENGTH                    equ 0001h
RA1PPS_RA1PPS3_MASK                      equ 0008h
RA1PPS_RA1PPS4_POSN                      equ 0004h
RA1PPS_RA1PPS4_POSITION                  equ 0004h
RA1PPS_RA1PPS4_SIZE                      equ 0001h
RA1PPS_RA1PPS4_LENGTH                    equ 0001h
RA1PPS_RA1PPS4_MASK                      equ 0010h
RA1PPS_RA1PPS5_POSN                      equ 0005h
RA1PPS_RA1PPS5_POSITION                  equ 0005h
RA1PPS_RA1PPS5_SIZE                      equ 0001h
RA1PPS_RA1PPS5_LENGTH                    equ 0001h
RA1PPS_RA1PPS5_MASK                      equ 0020h

// Register: RA2PPS
#define RA2PPS RA2PPS
RA2PPS                                   equ 01F12h
// bitfield definitions
RA2PPS_RA2PPS_POSN                       equ 0000h
RA2PPS_RA2PPS_POSITION                   equ 0000h
RA2PPS_RA2PPS_SIZE                       equ 0006h
RA2PPS_RA2PPS_LENGTH                     equ 0006h
RA2PPS_RA2PPS_MASK                       equ 003Fh
RA2PPS_RA2PPS0_POSN                      equ 0000h
RA2PPS_RA2PPS0_POSITION                  equ 0000h
RA2PPS_RA2PPS0_SIZE                      equ 0001h
RA2PPS_RA2PPS0_LENGTH                    equ 0001h
RA2PPS_RA2PPS0_MASK                      equ 0001h
RA2PPS_RA2PPS1_POSN                      equ 0001h
RA2PPS_RA2PPS1_POSITION                  equ 0001h
RA2PPS_RA2PPS1_SIZE                      equ 0001h
RA2PPS_RA2PPS1_LENGTH                    equ 0001h
RA2PPS_RA2PPS1_MASK                      equ 0002h
RA2PPS_RA2PPS2_POSN                      equ 0002h
RA2PPS_RA2PPS2_POSITION                  equ 0002h
RA2PPS_RA2PPS2_SIZE                      equ 0001h
RA2PPS_RA2PPS2_LENGTH                    equ 0001h
RA2PPS_RA2PPS2_MASK                      equ 0004h
RA2PPS_RA2PPS3_POSN                      equ 0003h
RA2PPS_RA2PPS3_POSITION                  equ 0003h
RA2PPS_RA2PPS3_SIZE                      equ 0001h
RA2PPS_RA2PPS3_LENGTH                    equ 0001h
RA2PPS_RA2PPS3_MASK                      equ 0008h
RA2PPS_RA2PPS4_POSN                      equ 0004h
RA2PPS_RA2PPS4_POSITION                  equ 0004h
RA2PPS_RA2PPS4_SIZE                      equ 0001h
RA2PPS_RA2PPS4_LENGTH                    equ 0001h
RA2PPS_RA2PPS4_MASK                      equ 0010h
RA2PPS_RA2PPS5_POSN                      equ 0005h
RA2PPS_RA2PPS5_POSITION                  equ 0005h
RA2PPS_RA2PPS5_SIZE                      equ 0001h
RA2PPS_RA2PPS5_LENGTH                    equ 0001h
RA2PPS_RA2PPS5_MASK                      equ 0020h

