GopalSaraf/Practicals/PSDL/include/proc/pic16f15275.inc
// Register: RC3PPS
#define RC3PPS RC3PPS
RC3PPS                                   equ 01F23h
// bitfield definitions
RC3PPS_RC3PPS_POSN                       equ 0000h
RC3PPS_RC3PPS_POSITION                   equ 0000h
RC3PPS_RC3PPS_SIZE                       equ 0006h
RC3PPS_RC3PPS_LENGTH                     equ 0006h
RC3PPS_RC3PPS_MASK                       equ 003Fh
RC3PPS_RC3PPS0_POSN                      equ 0000h
RC3PPS_RC3PPS0_POSITION                  equ 0000h
RC3PPS_RC3PPS0_SIZE                      equ 0001h
RC3PPS_RC3PPS0_LENGTH                    equ 0001h
RC3PPS_RC3PPS0_MASK                      equ 0001h
RC3PPS_RC3PPS1_POSN                      equ 0001h
RC3PPS_RC3PPS1_POSITION                  equ 0001h
RC3PPS_RC3PPS1_SIZE                      equ 0001h
RC3PPS_RC3PPS1_LENGTH                    equ 0001h
RC3PPS_RC3PPS1_MASK                      equ 0002h
RC3PPS_RC3PPS2_POSN                      equ 0002h
RC3PPS_RC3PPS2_POSITION                  equ 0002h
RC3PPS_RC3PPS2_SIZE                      equ 0001h
RC3PPS_RC3PPS2_LENGTH                    equ 0001h
RC3PPS_RC3PPS2_MASK                      equ 0004h
RC3PPS_RC3PPS3_POSN                      equ 0003h
RC3PPS_RC3PPS3_POSITION                  equ 0003h
RC3PPS_RC3PPS3_SIZE                      equ 0001h
RC3PPS_RC3PPS3_LENGTH                    equ 0001h
RC3PPS_RC3PPS3_MASK                      equ 0008h
RC3PPS_RC3PPS4_POSN                      equ 0004h
RC3PPS_RC3PPS4_POSITION                  equ 0004h
RC3PPS_RC3PPS4_SIZE                      equ 0001h
RC3PPS_RC3PPS4_LENGTH                    equ 0001h
RC3PPS_RC3PPS4_MASK                      equ 0010h
RC3PPS_RC3PPS5_POSN                      equ 0005h
RC3PPS_RC3PPS5_POSITION                  equ 0005h
RC3PPS_RC3PPS5_SIZE                      equ 0001h
RC3PPS_RC3PPS5_LENGTH                    equ 0001h
RC3PPS_RC3PPS5_MASK                      equ 0020h

// Register: RC4PPS
#define RC4PPS RC4PPS
RC4PPS                                   equ 01F24h
// bitfield definitions
RC4PPS_RC4PPS_POSN                       equ 0000h
RC4PPS_RC4PPS_POSITION                   equ 0000h
RC4PPS_RC4PPS_SIZE                       equ 0006h
RC4PPS_RC4PPS_LENGTH                     equ 0006h
RC4PPS_RC4PPS_MASK                       equ 003Fh
RC4PPS_RC4PPS0_POSN                      equ 0000h
RC4PPS_RC4PPS0_POSITION                  equ 0000h
RC4PPS_RC4PPS0_SIZE                      equ 0001h
RC4PPS_RC4PPS0_LENGTH                    equ 0001h
RC4PPS_RC4PPS0_MASK                      equ 0001h
RC4PPS_RC4PPS1_POSN                      equ 0001h
RC4PPS_RC4PPS1_POSITION                  equ 0001h
RC4PPS_RC4PPS1_SIZE                      equ 0001h
RC4PPS_RC4PPS1_LENGTH                    equ 0001h
RC4PPS_RC4PPS1_MASK                      equ 0002h
RC4PPS_RC4PPS2_POSN                      equ 0002h
RC4PPS_RC4PPS2_POSITION                  equ 0002h
RC4PPS_RC4PPS2_SIZE                      equ 0001h
RC4PPS_RC4PPS2_LENGTH                    equ 0001h
RC4PPS_RC4PPS2_MASK                      equ 0004h
RC4PPS_RC4PPS3_POSN                      equ 0003h
RC4PPS_RC4PPS3_POSITION                  equ 0003h
RC4PPS_RC4PPS3_SIZE                      equ 0001h
RC4PPS_RC4PPS3_LENGTH                    equ 0001h
RC4PPS_RC4PPS3_MASK                      equ 0008h
RC4PPS_RC4PPS4_POSN                      equ 0004h
RC4PPS_RC4PPS4_POSITION                  equ 0004h
RC4PPS_RC4PPS4_SIZE                      equ 0001h
RC4PPS_RC4PPS4_LENGTH                    equ 0001h
RC4PPS_RC4PPS4_MASK                      equ 0010h
RC4PPS_RC4PPS5_POSN                      equ 0005h
RC4PPS_RC4PPS5_POSITION                  equ 0005h
RC4PPS_RC4PPS5_SIZE                      equ 0001h
RC4PPS_RC4PPS5_LENGTH                    equ 0001h
RC4PPS_RC4PPS5_MASK                      equ 0020h

// Register: RC5PPS
#define RC5PPS RC5PPS
RC5PPS                                   equ 01F25h
// bitfield definitions
RC5PPS_RC5PPS_POSN                       equ 0000h
RC5PPS_RC5PPS_POSITION                   equ 0000h
RC5PPS_RC5PPS_SIZE                       equ 0006h
RC5PPS_RC5PPS_LENGTH                     equ 0006h
RC5PPS_RC5PPS_MASK                       equ 003Fh
RC5PPS_RC5PPS0_POSN                      equ 0000h
RC5PPS_RC5PPS0_POSITION                  equ 0000h
RC5PPS_RC5PPS0_SIZE                      equ 0001h
RC5PPS_RC5PPS0_LENGTH                    equ 0001h
RC5PPS_RC5PPS0_MASK                      equ 0001h
RC5PPS_RC5PPS1_POSN                      equ 0001h
RC5PPS_RC5PPS1_POSITION                  equ 0001h
RC5PPS_RC5PPS1_SIZE                      equ 0001h
RC5PPS_RC5PPS1_LENGTH                    equ 0001h
RC5PPS_RC5PPS1_MASK                      equ 0002h
RC5PPS_RC5PPS2_POSN                      equ 0002h
RC5PPS_RC5PPS2_POSITION                  equ 0002h
RC5PPS_RC5PPS2_SIZE                      equ 0001h
RC5PPS_RC5PPS2_LENGTH                    equ 0001h
RC5PPS_RC5PPS2_MASK                      equ 0004h
RC5PPS_RC5PPS3_POSN                      equ 0003h
RC5PPS_RC5PPS3_POSITION                  equ 0003h
RC5PPS_RC5PPS3_SIZE                      equ 0001h
RC5PPS_RC5PPS3_LENGTH                    equ 0001h
RC5PPS_RC5PPS3_MASK                      equ 0008h
RC5PPS_RC5PPS4_POSN                      equ 0004h
RC5PPS_RC5PPS4_POSITION                  equ 0004h
RC5PPS_RC5PPS4_SIZE                      equ 0001h
RC5PPS_RC5PPS4_LENGTH                    equ 0001h
RC5PPS_RC5PPS4_MASK                      equ 0010h
RC5PPS_RC5PPS5_POSN                      equ 0005h
RC5PPS_RC5PPS5_POSITION                  equ 0005h
RC5PPS_RC5PPS5_SIZE                      equ 0001h
RC5PPS_RC5PPS5_LENGTH                    equ 0001h
RC5PPS_RC5PPS5_MASK                      equ 0020h

// Register: RC6PPS
#define RC6PPS RC6PPS
RC6PPS                                   equ 01F26h
// bitfield definitions
RC6PPS_RC6PPS_POSN                       equ 0000h
RC6PPS_RC6PPS_POSITION                   equ 0000h
RC6PPS_RC6PPS_SIZE                       equ 0006h
RC6PPS_RC6PPS_LENGTH                     equ 0006h
RC6PPS_RC6PPS_MASK                       equ 003Fh
RC6PPS_RC6PPS0_POSN                      equ 0000h
RC6PPS_RC6PPS0_POSITION                  equ 0000h
RC6PPS_RC6PPS0_SIZE                      equ 0001h
RC6PPS_RC6PPS0_LENGTH                    equ 0001h
RC6PPS_RC6PPS0_MASK                      equ 0001h
RC6PPS_RC6PPS1_POSN                      equ 0001h
RC6PPS_RC6PPS1_POSITION                  equ 0001h
RC6PPS_RC6PPS1_SIZE                      equ 0001h
RC6PPS_RC6PPS1_LENGTH                    equ 0001h
RC6PPS_RC6PPS1_MASK                      equ 0002h
RC6PPS_RC6PPS2_POSN                      equ 0002h
RC6PPS_RC6PPS2_POSITION                  equ 0002h
RC6PPS_RC6PPS2_SIZE                      equ 0001h
RC6PPS_RC6PPS2_LENGTH                    equ 0001h
RC6PPS_RC6PPS2_MASK                      equ 0004h
RC6PPS_RC6PPS3_POSN                      equ 0003h
RC6PPS_RC6PPS3_POSITION                  equ 0003h
RC6PPS_RC6PPS3_SIZE                      equ 0001h
RC6PPS_RC6PPS3_LENGTH                    equ 0001h
RC6PPS_RC6PPS3_MASK                      equ 0008h
RC6PPS_RC6PPS4_POSN                      equ 0004h
RC6PPS_RC6PPS4_POSITION                  equ 0004h
RC6PPS_RC6PPS4_SIZE                      equ 0001h
RC6PPS_RC6PPS4_LENGTH                    equ 0001h
RC6PPS_RC6PPS4_MASK                      equ 0010h
RC6PPS_RC6PPS5_POSN                      equ 0005h
RC6PPS_RC6PPS5_POSITION                  equ 0005h
RC6PPS_RC6PPS5_SIZE                      equ 0001h
RC6PPS_RC6PPS5_LENGTH                    equ 0001h
RC6PPS_RC6PPS5_MASK                      equ 0020h

// Register: RC7PPS
#define RC7PPS RC7PPS
RC7PPS                                   equ 01F27h
// bitfield definitions
RC7PPS_RC7PPS_POSN                       equ 0000h
RC7PPS_RC7PPS_POSITION                   equ 0000h
RC7PPS_RC7PPS_SIZE                       equ 0006h
RC7PPS_RC7PPS_LENGTH                     equ 0006h
RC7PPS_RC7PPS_MASK                       equ 003Fh
RC7PPS_RC7PPS0_POSN                      equ 0000h
RC7PPS_RC7PPS0_POSITION                  equ 0000h
RC7PPS_RC7PPS0_SIZE                      equ 0001h
RC7PPS_RC7PPS0_LENGTH                    equ 0001h
RC7PPS_RC7PPS0_MASK                      equ 0001h
RC7PPS_RC7PPS1_POSN                      equ 0001h
RC7PPS_RC7PPS1_POSITION                  equ 0001h
RC7PPS_RC7PPS1_SIZE                      equ 0001h
RC7PPS_RC7PPS1_LENGTH                    equ 0001h
RC7PPS_RC7PPS1_MASK                      equ 0002h
RC7PPS_RC7PPS2_POSN                      equ 0002h
RC7PPS_RC7PPS2_POSITION                  equ 0002h
RC7PPS_RC7PPS2_SIZE                      equ 0001h
RC7PPS_RC7PPS2_LENGTH                    equ 0001h
RC7PPS_RC7PPS2_MASK                      equ 0004h
RC7PPS_RC7PPS3_POSN                      equ 0003h
RC7PPS_RC7PPS3_POSITION                  equ 0003h
RC7PPS_RC7PPS3_SIZE                      equ 0001h
RC7PPS_RC7PPS3_LENGTH                    equ 0001h
RC7PPS_RC7PPS3_MASK                      equ 0008h
RC7PPS_RC7PPS4_POSN                      equ 0004h
RC7PPS_RC7PPS4_POSITION                  equ 0004h
RC7PPS_RC7PPS4_SIZE                      equ 0001h
RC7PPS_RC7PPS4_LENGTH                    equ 0001h
RC7PPS_RC7PPS4_MASK                      equ 0010h
RC7PPS_RC7PPS5_POSN                      equ 0005h
RC7PPS_RC7PPS5_POSITION                  equ 0005h
RC7PPS_RC7PPS5_SIZE                      equ 0001h
RC7PPS_RC7PPS5_LENGTH                    equ 0001h
RC7PPS_RC7PPS5_MASK                      equ 0020h

// Register: RD0PPS
#define RD0PPS RD0PPS
RD0PPS                                   equ 01F28h
// bitfield definitions
RD0PPS_RD0PPS_POSN                       equ 0000h
RD0PPS_RD0PPS_POSITION                   equ 0000h
RD0PPS_RD0PPS_SIZE                       equ 0006h
RD0PPS_RD0PPS_LENGTH                     equ 0006h
RD0PPS_RD0PPS_MASK                       equ 003Fh
RD0PPS_RD0PPS0_POSN                      equ 0000h
RD0PPS_RD0PPS0_POSITION                  equ 0000h
RD0PPS_RD0PPS0_SIZE                      equ 0001h
RD0PPS_RD0PPS0_LENGTH                    equ 0001h
RD0PPS_RD0PPS0_MASK                      equ 0001h
RD0PPS_RD0PPS1_POSN                      equ 0001h
RD0PPS_RD0PPS1_POSITION                  equ 0001h
RD0PPS_RD0PPS1_SIZE                      equ 0001h
RD0PPS_RD0PPS1_LENGTH                    equ 0001h
RD0PPS_RD0PPS1_MASK                      equ 0002h
RD0PPS_RD0PPS2_POSN                      equ 0002h
RD0PPS_RD0PPS2_POSITION                  equ 0002h
RD0PPS_RD0PPS2_SIZE                      equ 0001h
RD0PPS_RD0PPS2_LENGTH                    equ 0001h
RD0PPS_RD0PPS2_MASK                      equ 0004h
RD0PPS_RD0PPS3_POSN                      equ 0003h
RD0PPS_RD0PPS3_POSITION                  equ 0003h
RD0PPS_RD0PPS3_SIZE                      equ 0001h
RD0PPS_RD0PPS3_LENGTH                    equ 0001h
RD0PPS_RD0PPS3_MASK                      equ 0008h
RD0PPS_RD0PPS4_POSN                      equ 0004h
RD0PPS_RD0PPS4_POSITION                  equ 0004h
RD0PPS_RD0PPS4_SIZE                      equ 0001h
RD0PPS_RD0PPS4_LENGTH                    equ 0001h
RD0PPS_RD0PPS4_MASK                      equ 0010h
RD0PPS_RD0PPS5_POSN                      equ 0005h
RD0PPS_RD0PPS5_POSITION                  equ 0005h
RD0PPS_RD0PPS5_SIZE                      equ 0001h
RD0PPS_RD0PPS5_LENGTH                    equ 0001h
RD0PPS_RD0PPS5_MASK                      equ 0020h

// Register: RD1PPS
#define RD1PPS RD1PPS
RD1PPS                                   equ 01F29h
// bitfield definitions
RD1PPS_RD1PPS_POSN                       equ 0000h
RD1PPS_RD1PPS_POSITION                   equ 0000h
RD1PPS_RD1PPS_SIZE                       equ 0006h
RD1PPS_RD1PPS_LENGTH                     equ 0006h
RD1PPS_RD1PPS_MASK                       equ 003Fh
RD1PPS_RD1PPS0_POSN                      equ 0000h
RD1PPS_RD1PPS0_POSITION                  equ 0000h
RD1PPS_RD1PPS0_SIZE                      equ 0001h
RD1PPS_RD1PPS0_LENGTH                    equ 0001h
RD1PPS_RD1PPS0_MASK                      equ 0001h
RD1PPS_RD1PPS1_POSN                      equ 0001h
RD1PPS_RD1PPS1_POSITION                  equ 0001h
RD1PPS_RD1PPS1_SIZE                      equ 0001h
RD1PPS_RD1PPS1_LENGTH                    equ 0001h
RD1PPS_RD1PPS1_MASK                      equ 0002h
RD1PPS_RD1PPS2_POSN                      equ 0002h
RD1PPS_RD1PPS2_POSITION                  equ 0002h
RD1PPS_RD1PPS2_SIZE                      equ 0001h
RD1PPS_RD1PPS2_LENGTH                    equ 0001h
RD1PPS_RD1PPS2_MASK                      equ 0004h
RD1PPS_RD1PPS3_POSN                      equ 0003h
RD1PPS_RD1PPS3_POSITION                  equ 0003h
RD1PPS_RD1PPS3_SIZE                      equ 0001h
RD1PPS_RD1PPS3_LENGTH                    equ 0001h
RD1PPS_RD1PPS3_MASK                      equ 0008h
RD1PPS_RD1PPS4_POSN                      equ 0004h
RD1PPS_RD1PPS4_POSITION                  equ 0004h
RD1PPS_RD1PPS4_SIZE                      equ 0001h
RD1PPS_RD1PPS4_LENGTH                    equ 0001h
RD1PPS_RD1PPS4_MASK                      equ 0010h
RD1PPS_RD1PPS5_POSN                      equ 0005h
RD1PPS_RD1PPS5_POSITION                  equ 0005h
RD1PPS_RD1PPS5_SIZE                      equ 0001h
RD1PPS_RD1PPS5_LENGTH                    equ 0001h
RD1PPS_RD1PPS5_MASK                      equ 0020h

// Register: RD2PPS
#define RD2PPS RD2PPS
RD2PPS                                   equ 01F2Ah
// bitfield definitions
RD2PPS_RD2PPS_POSN                       equ 0000h
RD2PPS_RD2PPS_POSITION                   equ 0000h
RD2PPS_RD2PPS_SIZE                       equ 0006h
RD2PPS_RD2PPS_LENGTH                     equ 0006h
RD2PPS_RD2PPS_MASK                       equ 003Fh
RD2PPS_RD2PPS0_POSN                      equ 0000h
RD2PPS_RD2PPS0_POSITION                  equ 0000h
RD2PPS_RD2PPS0_SIZE                      equ 0001h
RD2PPS_RD2PPS0_LENGTH                    equ 0001h
RD2PPS_RD2PPS0_MASK                      equ 0001h
RD2PPS_RD2PPS1_POSN                      equ 0001h
RD2PPS_RD2PPS1_POSITION                  equ 0001h
RD2PPS_RD2PPS1_SIZE                      equ 0001h
RD2PPS_RD2PPS1_LENGTH                    equ 0001h
RD2PPS_RD2PPS1_MASK                      equ 0002h
RD2PPS_RD2PPS2_POSN                      equ 0002h
RD2PPS_RD2PPS2_POSITION                  equ 0002h
RD2PPS_RD2PPS2_SIZE                      equ 0001h
RD2PPS_RD2PPS2_LENGTH                    equ 0001h
RD2PPS_RD2PPS2_MASK                      equ 0004h
RD2PPS_RD2PPS3_POSN                      equ 0003h
RD2PPS_RD2PPS3_POSITION                  equ 0003h
RD2PPS_RD2PPS3_SIZE                      equ 0001h
RD2PPS_RD2PPS3_LENGTH                    equ 0001h
RD2PPS_RD2PPS3_MASK                      equ 0008h
RD2PPS_RD2PPS4_POSN                      equ 0004h
RD2PPS_RD2PPS4_POSITION                  equ 0004h
RD2PPS_RD2PPS4_SIZE                      equ 0001h
RD2PPS_RD2PPS4_LENGTH                    equ 0001h
RD2PPS_RD2PPS4_MASK                      equ 0010h
RD2PPS_RD2PPS5_POSN                      equ 0005h
RD2PPS_RD2PPS5_POSITION                  equ 0005h
RD2PPS_RD2PPS5_SIZE                      equ 0001h
RD2PPS_RD2PPS5_LENGTH                    equ 0001h
RD2PPS_RD2PPS5_MASK                      equ 0020h

