GopalSaraf/Practicals/PSDL/include/proc/pic16f15275.inc
#define LATB1                            BANKMASK(LATB), 1
#define LATB2                            BANKMASK(LATB), 2
#define LATB3                            BANKMASK(LATB), 3
#define LATB4                            BANKMASK(LATB), 4
#define LATB5                            BANKMASK(LATB), 5
#define LATB6                            BANKMASK(LATB), 6
#define LATB7                            BANKMASK(LATB), 7
#define LATC0                            BANKMASK(LATC), 0
#define LATC1                            BANKMASK(LATC), 1
#define LATC2                            BANKMASK(LATC), 2
#define LATC3                            BANKMASK(LATC), 3
#define LATC4                            BANKMASK(LATC), 4
#define LATC5                            BANKMASK(LATC), 5
#define LATC6                            BANKMASK(LATC), 6
#define LATC7                            BANKMASK(LATC), 7
#define LATD0                            BANKMASK(LATD), 0
#define LATD1                            BANKMASK(LATD), 1
#define LATD2                            BANKMASK(LATD), 2
#define LATD3                            BANKMASK(LATD), 3
#define LATD4                            BANKMASK(LATD), 4
#define LATD5                            BANKMASK(LATD), 5
#define LATD6                            BANKMASK(LATD), 6
#define LATD7                            BANKMASK(LATD), 7
#define LATE0                            BANKMASK(LATE), 0
#define LATE1                            BANKMASK(LATE), 1
#define LATE2                            BANKMASK(LATE), 2
#define LFOEN                            BANKMASK(OSCEN), 4
#define LFOR                             BANKMASK(OSCSTAT), 4
#define LWLO                             BANKMASK(NVMCON1), 5
#define MD16                             BANKMASK(T0CON0), 4
#define MFOEN                            BANKMASK(OSCEN), 5
#define MFOR                             BANKMASK(OSCSTAT), 5
#define MODE4                            BANKMASK(T2HLT), 4
#define MSK01                            BANKMASK(SSP1ADD), 0
#define MSK11                            BANKMASK(SSP1ADD), 1
#define MSK21                            BANKMASK(SSP1ADD), 2
#define MSK31                            BANKMASK(SSP1ADD), 3
#define MSK41                            BANKMASK(SSP1ADD), 4
#define MSK51                            BANKMASK(SSP1ADD), 5
#define MSK61                            BANKMASK(SSP1ADD), 6
#define MSK71                            BANKMASK(SSP1ADD), 7
#define NDIV0                            BANKMASK(OSCCON), 0
#define NDIV1                            BANKMASK(OSCCON), 1
#define NDIV2                            BANKMASK(OSCCON), 2
#define NDIV3                            BANKMASK(OSCCON), 3
#define NOSC0                            BANKMASK(OSCCON), 4
#define NOSC1                            BANKMASK(OSCCON), 5
#define NOSC2                            BANKMASK(OSCCON), 6
#define NOT_DONE                         BANKMASK(T1GCON), 3
#define NOT_SYNC                         BANKMASK(T1CON), 2
#define NOT_T1DONE                       BANKMASK(T1GCON), 3
#define NOT_T1SYNC                       BANKMASK(T1CON), 2
#define NVMIE                            BANKMASK(PIE2), 6
#define NVMIF                            BANKMASK(PIR2), 6
#define NVMREGS                          BANKMASK(NVMCON1), 6
#define ODCA0                            BANKMASK(ODCONA), 0
#define ODCA1                            BANKMASK(ODCONA), 1
#define ODCA2                            BANKMASK(ODCONA), 2
#define ODCA3                            BANKMASK(ODCONA), 3
#define ODCA4                            BANKMASK(ODCONA), 4
#define ODCA5                            BANKMASK(ODCONA), 5
#define ODCA6                            BANKMASK(ODCONA), 6
#define ODCA7                            BANKMASK(ODCONA), 7
#define ODCB0                            BANKMASK(ODCONB), 0
#define ODCB1                            BANKMASK(ODCONB), 1
#define ODCB2                            BANKMASK(ODCONB), 2
#define ODCB3                            BANKMASK(ODCONB), 3
#define ODCB4                            BANKMASK(ODCONB), 4
#define ODCB5                            BANKMASK(ODCONB), 5
#define ODCB6                            BANKMASK(ODCONB), 6
#define ODCB7                            BANKMASK(ODCONB), 7
#define ODCC0                            BANKMASK(ODCONC), 0
#define ODCC1                            BANKMASK(ODCONC), 1
#define ODCC2                            BANKMASK(ODCONC), 2
#define ODCC3                            BANKMASK(ODCONC), 3
#define ODCC4                            BANKMASK(ODCONC), 4
#define ODCC5                            BANKMASK(ODCONC), 5
#define ODCC6                            BANKMASK(ODCONC), 6
#define ODCC7                            BANKMASK(ODCONC), 7
#define ODCD0                            BANKMASK(ODCOND), 0
#define ODCD1                            BANKMASK(ODCOND), 1
#define ODCD2                            BANKMASK(ODCOND), 2
#define ODCD3                            BANKMASK(ODCOND), 3
#define ODCD4                            BANKMASK(ODCOND), 4
#define ODCD5                            BANKMASK(ODCOND), 5
#define ODCD6                            BANKMASK(ODCOND), 6
#define ODCD7                            BANKMASK(ODCOND), 7
#define ODCE0                            BANKMASK(ODCONE), 0
#define ODCE1                            BANKMASK(ODCONE), 1
#define ODCE2                            BANKMASK(ODCONE), 2
#define OERR                             BANKMASK(RC1STA), 1
#define P1M1                             BANKMASK(CCP1CON), 7
#define P2                               BANKMASK(SSP1STAT), 4
#define P2M1                             BANKMASK(CCP2CON), 7
#define PCIE                             BANKMASK(SSP1CON3), 6
#define PEIE                             BANKMASK(INTCON), 6
#define PEN                              BANKMASK(SSP1CON2), 2
#define PEN1                             BANKMASK(SSP1CON2), 2
#define PPSLOCKED                        BANKMASK(PPSLOCK), 0
#define PSYNC                            BANKMASK(T2HLT), 7
#define PWM3EN                           BANKMASK(PWM3CON), 7
#define PWM3OUT                          BANKMASK(PWM3CON), 5
#define PWM3POL                          BANKMASK(PWM3CON), 4
#define PWM4EN                           BANKMASK(PWM4CON), 7
#define PWM4OUT                          BANKMASK(PWM4CON), 5
#define PWM4POL                          BANKMASK(PWM4CON), 4
#define RA0                              BANKMASK(PORTA), 0
#define RA0PPS0                          BANKMASK(RA0PPS), 0
#define RA0PPS1                          BANKMASK(RA0PPS), 1
#define RA0PPS2                          BANKMASK(RA0PPS), 2
#define RA0PPS3                          BANKMASK(RA0PPS), 3
#define RA0PPS4                          BANKMASK(RA0PPS), 4
#define RA0PPS5                          BANKMASK(RA0PPS), 5
#define RA1                              BANKMASK(PORTA), 1
#define RA1PPS0                          BANKMASK(RA1PPS), 0
#define RA1PPS1                          BANKMASK(RA1PPS), 1
#define RA1PPS2                          BANKMASK(RA1PPS), 2
#define RA1PPS3                          BANKMASK(RA1PPS), 3
#define RA1PPS4                          BANKMASK(RA1PPS), 4
#define RA1PPS5                          BANKMASK(RA1PPS), 5
#define RA2                              BANKMASK(PORTA), 2
#define RA2PPS0                          BANKMASK(RA2PPS), 0
#define RA2PPS1                          BANKMASK(RA2PPS), 1
#define RA2PPS2                          BANKMASK(RA2PPS), 2
#define RA2PPS3                          BANKMASK(RA2PPS), 3
#define RA2PPS4                          BANKMASK(RA2PPS), 4
#define RA2PPS5                          BANKMASK(RA2PPS), 5
#define RA3                              BANKMASK(PORTA), 3
#define RA3PPS0                          BANKMASK(RA3PPS), 0
#define RA3PPS1                          BANKMASK(RA3PPS), 1
#define RA3PPS2                          BANKMASK(RA3PPS), 2
#define RA3PPS3                          BANKMASK(RA3PPS), 3
#define RA3PPS4                          BANKMASK(RA3PPS), 4
#define RA3PPS5                          BANKMASK(RA3PPS), 5
#define RA4                              BANKMASK(PORTA), 4
#define RA4PPS0                          BANKMASK(RA4PPS), 0
#define RA4PPS1                          BANKMASK(RA4PPS), 1
#define RA4PPS2                          BANKMASK(RA4PPS), 2
#define RA4PPS3                          BANKMASK(RA4PPS), 3
#define RA4PPS4                          BANKMASK(RA4PPS), 4
#define RA4PPS5                          BANKMASK(RA4PPS), 5
#define RA5                              BANKMASK(PORTA), 5
#define RA5PPS0                          BANKMASK(RA5PPS), 0
#define RA5PPS1                          BANKMASK(RA5PPS), 1
#define RA5PPS2                          BANKMASK(RA5PPS), 2
#define RA5PPS3                          BANKMASK(RA5PPS), 3
#define RA5PPS4                          BANKMASK(RA5PPS), 4
#define RA5PPS5                          BANKMASK(RA5PPS), 5
#define RA6                              BANKMASK(PORTA), 6
#define RA6PPS0                          BANKMASK(RA6PPS), 0
#define RA6PPS1                          BANKMASK(RA6PPS), 1
#define RA6PPS2                          BANKMASK(RA6PPS), 2
#define RA6PPS3                          BANKMASK(RA6PPS), 3
#define RA6PPS4                          BANKMASK(RA6PPS), 4
#define RA6PPS5                          BANKMASK(RA6PPS), 5
#define RA7                              BANKMASK(PORTA), 7
#define RA7PPS0                          BANKMASK(RA7PPS), 0
#define RA7PPS1                          BANKMASK(RA7PPS), 1
#define RA7PPS2                          BANKMASK(RA7PPS), 2
#define RA7PPS3                          BANKMASK(RA7PPS), 3
#define RA7PPS4                          BANKMASK(RA7PPS), 4
#define RA7PPS5                          BANKMASK(RA7PPS), 5
#define RB0                              BANKMASK(PORTB), 0
#define RB0PPS0                          BANKMASK(RB0PPS), 0
#define RB0PPS1                          BANKMASK(RB0PPS), 1
#define RB0PPS2                          BANKMASK(RB0PPS), 2
#define RB0PPS3                          BANKMASK(RB0PPS), 3
#define RB0PPS4                          BANKMASK(RB0PPS), 4
#define RB0PPS5                          BANKMASK(RB0PPS), 5
#define RB1                              BANKMASK(PORTB), 1
#define RB1PPS0                          BANKMASK(RB1PPS), 0
#define RB1PPS1                          BANKMASK(RB1PPS), 1
#define RB1PPS2                          BANKMASK(RB1PPS), 2
#define RB1PPS3                          BANKMASK(RB1PPS), 3
#define RB1PPS4                          BANKMASK(RB1PPS), 4
#define RB1PPS5                          BANKMASK(RB1PPS), 5
#define RB2                              BANKMASK(PORTB), 2
#define RB2PPS0                          BANKMASK(RB2PPS), 0
#define RB2PPS1                          BANKMASK(RB2PPS), 1
#define RB2PPS2                          BANKMASK(RB2PPS), 2
#define RB2PPS3                          BANKMASK(RB2PPS), 3
#define RB2PPS4                          BANKMASK(RB2PPS), 4
#define RB2PPS5                          BANKMASK(RB2PPS), 5
#define RB3                              BANKMASK(PORTB), 3
#define RB3PPS0                          BANKMASK(RB3PPS), 0
#define RB3PPS1                          BANKMASK(RB3PPS), 1
#define RB3PPS2                          BANKMASK(RB3PPS), 2
#define RB3PPS3                          BANKMASK(RB3PPS), 3
#define RB3PPS4                          BANKMASK(RB3PPS), 4
#define RB3PPS5                          BANKMASK(RB3PPS), 5
#define RB4                              BANKMASK(PORTB), 4
#define RB4PPS0                          BANKMASK(RB4PPS), 0
#define RB4PPS1                          BANKMASK(RB4PPS), 1
#define RB4PPS2                          BANKMASK(RB4PPS), 2
#define RB4PPS3                          BANKMASK(RB4PPS), 3
#define RB4PPS4                          BANKMASK(RB4PPS), 4
#define RB4PPS5                          BANKMASK(RB4PPS), 5
#define RB5                              BANKMASK(PORTB), 5
#define RB5PPS0                          BANKMASK(RB5PPS), 0
#define RB5PPS1                          BANKMASK(RB5PPS), 1
#define RB5PPS2                          BANKMASK(RB5PPS), 2
#define RB5PPS3                          BANKMASK(RB5PPS), 3
#define RB5PPS4                          BANKMASK(RB5PPS), 4
#define RB5PPS5                          BANKMASK(RB5PPS), 5
#define RB6                              BANKMASK(PORTB), 6
#define RB6PPS0                          BANKMASK(RB6PPS), 0
#define RB6PPS1                          BANKMASK(RB6PPS), 1
#define RB6PPS2                          BANKMASK(RB6PPS), 2
#define RB6PPS3                          BANKMASK(RB6PPS), 3
#define RB6PPS4                          BANKMASK(RB6PPS), 4
#define RB6PPS5                          BANKMASK(RB6PPS), 5
#define RB7                              BANKMASK(PORTB), 7
#define RB7PPS0                          BANKMASK(RB7PPS), 0
#define RB7PPS1                          BANKMASK(RB7PPS), 1
#define RB7PPS2                          BANKMASK(RB7PPS), 2
#define RB7PPS3                          BANKMASK(RB7PPS), 3
#define RB7PPS4                          BANKMASK(RB7PPS), 4
#define RB7PPS5                          BANKMASK(RB7PPS), 5
#define RC0                              BANKMASK(PORTC), 0
#define RC0PPS0                          BANKMASK(RC0PPS), 0
#define RC0PPS1                          BANKMASK(RC0PPS), 1
#define RC0PPS2                          BANKMASK(RC0PPS), 2
#define RC0PPS3                          BANKMASK(RC0PPS), 3
#define RC0PPS4                          BANKMASK(RC0PPS), 4
#define RC0PPS5                          BANKMASK(RC0PPS), 5
#define RC1                              BANKMASK(PORTC), 1
#define RC1IE                            BANKMASK(PIE1), 4
#define RC1IF                            BANKMASK(PIR1), 4
#define RC1PPS0                          BANKMASK(RC1PPS), 0
#define RC1PPS1                          BANKMASK(RC1PPS), 1
#define RC1PPS2                          BANKMASK(RC1PPS), 2
#define RC1PPS3                          BANKMASK(RC1PPS), 3
#define RC1PPS4                          BANKMASK(RC1PPS), 4
#define RC1PPS5                          BANKMASK(RC1PPS), 5
#define RC2                              BANKMASK(PORTC), 2
#define RC2PPS0                          BANKMASK(RC2PPS), 0
#define RC2PPS1                          BANKMASK(RC2PPS), 1
#define RC2PPS2                          BANKMASK(RC2PPS), 2
#define RC2PPS3                          BANKMASK(RC2PPS), 3
#define RC2PPS4                          BANKMASK(RC2PPS), 4
#define RC2PPS5                          BANKMASK(RC2PPS), 5
#define RC3                              BANKMASK(PORTC), 3
#define RC3PPS0                          BANKMASK(RC3PPS), 0
#define RC3PPS1                          BANKMASK(RC3PPS), 1
#define RC3PPS2                          BANKMASK(RC3PPS), 2
#define RC3PPS3                          BANKMASK(RC3PPS), 3
#define RC3PPS4                          BANKMASK(RC3PPS), 4
#define RC3PPS5                          BANKMASK(RC3PPS), 5
#define RC4                              BANKMASK(PORTC), 4
#define RC4PPS0                          BANKMASK(RC4PPS), 0
#define RC4PPS1                          BANKMASK(RC4PPS), 1
#define RC4PPS2                          BANKMASK(RC4PPS), 2
#define RC4PPS3                          BANKMASK(RC4PPS), 3
#define RC4PPS4                          BANKMASK(RC4PPS), 4
#define RC4PPS5                          BANKMASK(RC4PPS), 5
#define RC5                              BANKMASK(PORTC), 5
#define RC5PPS0                          BANKMASK(RC5PPS), 0
#define RC5PPS1                          BANKMASK(RC5PPS), 1
#define RC5PPS2                          BANKMASK(RC5PPS), 2
#define RC5PPS3                          BANKMASK(RC5PPS), 3
#define RC5PPS4                          BANKMASK(RC5PPS), 4
#define RC5PPS5                          BANKMASK(RC5PPS), 5
#define RC6                              BANKMASK(PORTC), 6
#define RC6PPS0                          BANKMASK(RC6PPS), 0
#define RC6PPS1                          BANKMASK(RC6PPS), 1
#define RC6PPS2                          BANKMASK(RC6PPS), 2
#define RC6PPS3                          BANKMASK(RC6PPS), 3
#define RC6PPS4                          BANKMASK(RC6PPS), 4
#define RC6PPS5                          BANKMASK(RC6PPS), 5
#define RC7                              BANKMASK(PORTC), 7
#define RC7PPS0                          BANKMASK(RC7PPS), 0
#define RC7PPS1                          BANKMASK(RC7PPS), 1
#define RC7PPS2                          BANKMASK(RC7PPS), 2
#define RC7PPS3                          BANKMASK(RC7PPS), 3
#define RC7PPS4                          BANKMASK(RC7PPS), 4
#define RC7PPS5                          BANKMASK(RC7PPS), 5
#define RCEN                             BANKMASK(SSP1CON2), 3
#define RCEN1                            BANKMASK(SSP1CON2), 3
#define RCIDL                            BANKMASK(BAUD1CON), 6
#define RD                               BANKMASK(NVMCON1), 0
#define RD0                              BANKMASK(PORTD), 0
#define RD0PPS0                          BANKMASK(RD0PPS), 0
#define RD0PPS1                          BANKMASK(RD0PPS), 1
#define RD0PPS2                          BANKMASK(RD0PPS), 2
#define RD0PPS3                          BANKMASK(RD0PPS), 3
#define RD0PPS4                          BANKMASK(RD0PPS), 4
#define RD0PPS5                          BANKMASK(RD0PPS), 5
#define RD1                              BANKMASK(PORTD), 1
#define RD16                             BANKMASK(T1CON), 1
#define RD161                            BANKMASK(T1CON), 1
#define RD1PPS0                          BANKMASK(RD1PPS), 0
#define RD1PPS1                          BANKMASK(RD1PPS), 1
#define RD1PPS2                          BANKMASK(RD1PPS), 2
#define RD1PPS3                          BANKMASK(RD1PPS), 3
#define RD1PPS4                          BANKMASK(RD1PPS), 4
#define RD1PPS5                          BANKMASK(RD1PPS), 5
#define RD2                              BANKMASK(PORTD), 2
#define RD2PPS0                          BANKMASK(RD2PPS), 0
#define RD2PPS1                          BANKMASK(RD2PPS), 1
#define RD2PPS2                          BANKMASK(RD2PPS), 2
#define RD2PPS3                          BANKMASK(RD2PPS), 3
#define RD2PPS4                          BANKMASK(RD2PPS), 4
#define RD2PPS5                          BANKMASK(RD2PPS), 5
#define RD3                              BANKMASK(PORTD), 3
#define RD3PPS0                          BANKMASK(RD3PPS), 0
#define RD3PPS1                          BANKMASK(RD3PPS), 1
#define RD3PPS2                          BANKMASK(RD3PPS), 2
#define RD3PPS3                          BANKMASK(RD3PPS), 3
#define RD3PPS4                          BANKMASK(RD3PPS), 4
#define RD3PPS5                          BANKMASK(RD3PPS), 5
#define RD4                              BANKMASK(PORTD), 4
#define RD4PPS0                          BANKMASK(RD4PPS), 0
#define RD4PPS1                          BANKMASK(RD4PPS), 1
#define RD4PPS2                          BANKMASK(RD4PPS), 2
#define RD4PPS3                          BANKMASK(RD4PPS), 3
#define RD4PPS4                          BANKMASK(RD4PPS), 4
#define RD4PPS5                          BANKMASK(RD4PPS), 5
#define RD5                              BANKMASK(PORTD), 5
#define RD5PPS0                          BANKMASK(RD5PPS), 0
#define RD5PPS1                          BANKMASK(RD5PPS), 1
#define RD5PPS2                          BANKMASK(RD5PPS), 2
#define RD5PPS3                          BANKMASK(RD5PPS), 3
#define RD5PPS4                          BANKMASK(RD5PPS), 4
#define RD5PPS5                          BANKMASK(RD5PPS), 5
#define RD6                              BANKMASK(PORTD), 6
#define RD6PPS0                          BANKMASK(RD6PPS), 0
#define RD6PPS1                          BANKMASK(RD6PPS), 1
#define RD6PPS2                          BANKMASK(RD6PPS), 2
#define RD6PPS3                          BANKMASK(RD6PPS), 3
#define RD6PPS4                          BANKMASK(RD6PPS), 4
#define RD6PPS5                          BANKMASK(RD6PPS), 5
#define RD7                              BANKMASK(PORTD), 7
#define RD7PPS0                          BANKMASK(RD7PPS), 0
#define RD7PPS1                          BANKMASK(RD7PPS), 1
#define RD7PPS2                          BANKMASK(RD7PPS), 2
#define RD7PPS3                          BANKMASK(RD7PPS), 3
#define RD7PPS4                          BANKMASK(RD7PPS), 4
#define RD7PPS5                          BANKMASK(RD7PPS), 5
#define RE0                              BANKMASK(PORTE), 0
#define RE0PPS0                          BANKMASK(RE0PPS), 0
#define RE0PPS1                          BANKMASK(RE0PPS), 1
#define RE0PPS2                          BANKMASK(RE0PPS), 2
#define RE0PPS3                          BANKMASK(RE0PPS), 3
#define RE0PPS4                          BANKMASK(RE0PPS), 4
#define RE0PPS5                          BANKMASK(RE0PPS), 5
#define RE1                              BANKMASK(PORTE), 1
#define RE1PPS0                          BANKMASK(RE1PPS), 0
#define RE1PPS1                          BANKMASK(RE1PPS), 1
#define RE1PPS2                          BANKMASK(RE1PPS), 2
#define RE1PPS3                          BANKMASK(RE1PPS), 3
#define RE1PPS4                          BANKMASK(RE1PPS), 4
#define RE1PPS5                          BANKMASK(RE1PPS), 5
#define RE2                              BANKMASK(PORTE), 2
#define RE2PPS0                          BANKMASK(RE2PPS), 0
#define RE2PPS1                          BANKMASK(RE2PPS), 1
#define RE2PPS2                          BANKMASK(RE2PPS), 2
#define RE2PPS3                          BANKMASK(RE2PPS), 3
#define RE2PPS4                          BANKMASK(RE2PPS), 4
#define RE2PPS5                          BANKMASK(RE2PPS), 5
#define RE3                              BANKMASK(PORTE), 3
#define READ_WRITE                       BANKMASK(SSP1STAT), 2
#define READ_WRITE1                      BANKMASK(SSP1STAT), 2
#define RSEL0                            BANKMASK(T2RST), 0
#define RSEL1                            BANKMASK(T2RST), 1
#define RSEL2                            BANKMASK(T2RST), 2
#define RSEL3                            BANKMASK(T2RST), 3
#define RSEN                             BANKMASK(SSP1CON2), 1
#define RSEN1                            BANKMASK(SSP1CON2), 1
#define RW                               BANKMASK(SSP1STAT), 2
#define RW1                              BANKMASK(SSP1STAT), 2
#define RX1DTPPS0                        BANKMASK(RX1PPS), 0
#define RX1DTPPS1                        BANKMASK(RX1PPS), 1
#define RX1DTPPS2                        BANKMASK(RX1PPS), 2
#define RX1DTPPS3                        BANKMASK(RX1PPS), 3
#define RX1DTPPS4                        BANKMASK(RX1PPS), 4
#define RX9                              BANKMASK(RC1STA), 6
#define RX9D                             BANKMASK(RC1STA), 0
#define R_W                              BANKMASK(SSP1STAT), 2
#define R_W1                             BANKMASK(SSP1STAT), 2
#define R_nW                             BANKMASK(SSP1STAT), 2
#define R_nW1                            BANKMASK(SSP1STAT), 2
#define S2                               BANKMASK(SSP1STAT), 3
#define SBCDE                            BANKMASK(SSP1CON3), 2
#define SBOREN                           BANKMASK(BORCON), 7
#define SCIE                             BANKMASK(SSP1CON3), 5
#define SCKP                             BANKMASK(BAUD1CON), 4
#define SDAHT                            BANKMASK(SSP1CON3), 3
#define SEN1                             BANKMASK(SSP1CON2), 0
#define SENDB                            BANKMASK(TX1STA), 3
#define SFOR                             BANKMASK(OSCSTAT), 1
#define SLRA0                            BANKMASK(SLRCONA), 0
#define SLRA1                            BANKMASK(SLRCONA), 1
#define SLRA2                            BANKMASK(SLRCONA), 2
#define SLRA3                            BANKMASK(SLRCONA), 3
